{"_name_or_path": "microsoft/deberta-v3-small", "architectures": ["DebertaV2ForSequenceClassification"], "attention_probs_dropout_prob": 0.4, "hidden_act": "gelu", "hidden_dropout_prob": 0.3, "hidden_size": 768, "id2label": {"0": "ADEQUATE", "1": "EFFECTIVE", "2": "INEFFECTIVE"}, "initializer_range": 0.02, "intermediate_size": 3072, "label2id": {"ADEQUATE": 0, "EFFECTIVE": 1, "INEFFECTIVE": 2}, "layer_norm_eps": 1e-12, "max_position_embeddings": 128, "max_relative_positions": -1, "model_type": "deberta-v2", "norm_rel_ebd": "layer_norm", "num_attention_heads": 12, "num_hidden_layers": 6, "pad_token_id": 0, "pooler_dropout": 0.4, "pooler_hidden_act": "gelu", "pooler_hidden_size": 768, "pos_att_type": ["p2c", "c2p"], "position_biased_input": false, "position_buckets": 256, "relative_attention": true, "share_att_key": true, "torch_dtype": "float32", "transformers_version": "4.21.1", "type_vocab_size": 0, "vocab_size": 128100}